soap.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:sear="http://eur-lex.europa.eu/search">
  <soap:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soap:mustUnderstand="true">
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-1">
        <wsse:Username>username</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <!-- http://eur-lex.europa.eu/eurlex-ws?wsdl -->
  <soap:Body>
    <sear:searchRequest>
      <sear:expertQuery>DTS_SUBDOM = EU_CASE_LAW</sear:expertQuery>
      <sear:page>1</sear:page>
      <!-- Max 100 -->
      <sear:pageSize>100</sear:pageSize>
      <sear:searchLanguage>fr</sear:searchLanguage>
    </sear:searchRequest>
  </soap:Body>
</soap:Envelope>